{
  "add_bos_token": true,
  "add_eos_token": false,

  "bos_token": {
    "__type": "AddedToken",
    "content": "<s>",
    "lstrip": false,
    "normalized": true,
    "rstrip": false,
    "single_word": false
  },

  "clean_up_tokenization_spaces": false,

  "eos_token": {
    "__type": "AddedToken",
    "content": "</s>", 
    "lstrip": false,
    "normalized": true,
    "rstrip": false,
    "single_word": false
  },

  "model_max_length": 1000000000000000019884624838656,
  
  "pad_token": {
    "__type": "AddedToken",
    "content":"[PAD]",
    "lstrip": false,
    "normalized": true, 
    "rstrip": false,
    "single_word": false
  },

  "sp_model_kwargs": {},
  
  "tokenizer_class": "LlamaTokenizer",

  "unk_token": {
    "__type": "AddedToken",
    "content": "<unk>",
    "lstrip": false,
    "normalized": true,
    "rstrip": false,
    "single_word": false
  },

  "do_lower_case": false,
  "do_basic_tokenize": true,
  "never_split": null,
  "start_n_top": null,
  "end_n_top": null,
  "mask_token": null,
  "cls_token": null,
  "sep_token": null,
  "strip_accents": null,
  "handle_chinese_chars": true,
  "wordpieces_prefix": "##"
}